In [1]:
#import dependencies
import pandas as pd
from sqlalchemy import create_engine
from config import password

In [2]:
# Load in CSV population data
data = pd.read_csv("Resources/PEP_2017_PEPANNRES_with_ann.csv", encoding='latin-1')
data.head()

,GEO.id,GEO.id2,GEO.display-label,rescen42010,resbase42010,respop72010,respop72011,respop72012,respop72013,respop72014,respop72015,respop72016,respop72017
0,Id,Id2,Geography,"April 1, 2010 - Census","April 1, 2010 - Estimates Base",Population Estimate (as of July 1) - 2010,Population Estimate (as of July 1) - 2011,Population Estimate (as of July 1) - 2012,Population Estimate (as of July 1) - 2013,Population Estimate (as of July 1) - 2014,Population Estimate (as of July 1) - 2015,Population Estimate (as of July 1) - 2016,Population Estimate (as of July 1) - 2017
1,1620000US0100124,100124,"Abbeville city, Alabama",2688,2688,2684,2677,2629,2612,2595,2587,2575,2567
2,1620000US0100460,100460,"Adamsville city, Alabama",4522,4522,4516,4502,4479,4457,4437,4409,4376,4347
3,1620000US0100484,100484,"Addison town, Alabama",758,754,751,751,744,743,740,734,734,728
4,1620000US0100676,100676,"Akron town, Alabama",356,356,355,345,345,341,337,335,332,332

In [3]:
# Grab only relevant columns
data_col = data[['GEO.display-label', 'rescen42010', 'respop72017']]
data_col.head()

,GEO.display-label,rescen42010,respop72017
0,Geography,"April 1, 2010 - Census",Population Estimate (as of July 1) - 2017
1,"Abbeville city, Alabama",2688,2567
2,"Adamsville city, Alabama",4522,4347
3,"Addison town, Alabama",758,728
4,"Akron town, Alabama",356,332

In [4]:
# Rename columns
data_col.columns = ['Location', '2010_Population', '2017_Population']
data_col.head()

,Location,2010_Population,2017_Population
0,Geography,"April 1, 2010 - Census",Population Estimate (as of July 1) - 2017
1,"Abbeville city, Alabama",2688,2567
2,"Adamsville city, Alabama",4522,4347
3,"Addison town, Alabama",758,728
4,"Akron town, Alabama",356,332

In [5]:
# Delete first row
data_col_1 = data_col.drop(data_col.index[0])
data_col_1.head()

                   Location 2010_Population 2017_Population
1   Abbeville city, Alabama            2688            2567
2  Adamsville city, Alabama            4522            4347
3     Addison town, Alabama             758             728
4       Akron town, Alabama             356             332
5   Alabaster city, Alabama           30352           33202

In [6]:
# Reset index
data_col_1.reset_index(drop = True, inplace=True)
data_col_1.head()

                   Location 2010_Population 2017_Population
0   Abbeville city, Alabama            2688            2567
1  Adamsville city, Alabama            4522            4347
2     Addison town, Alabama             758             728
3       Akron town, Alabama             356             332
4   Alabaster city, Alabama           30352           33202

In [7]:
# Split City column into City aqnd State
data_split = data_col_1["Location"].str.split(" city,| town,", expand = True)
data_split.head(40)

                 0         1
0        Abbeville   Alabama
1       Adamsville   Alabama
2          Addison   Alabama
3            Akron   Alabama
4        Alabaster   Alabama
5      Albertville   Alabama
6   Alexander City   Alabama
7       Aliceville   Alabama
8          Allgood   Alabama
9          Altoona   Alabama
10       Andalusia   Alabama
11        Anderson   Alabama
12        Anniston   Alabama
13            Arab   Alabama
14         Ardmore   Alabama
15            Argo   Alabama
16          Ariton   Alabama
17           Arley   Alabama
18         Ashford   Alabama
19         Ashland   Alabama
20        Ashville   Alabama
21          Athens   Alabama
22          Atmore   Alabama
23         Attalla   Alabama
24          Auburn   Alabama
25    Autaugaville   Alabama
26            Avon   Alabama
27          Babbie   Alabama
28       Baileyton   Alabama
29       Bakerhill   Alabama
30           Banks   Alabama
31     Bay Minette   Alabama
32  Bayou La Batre   Alabama
33      Bear Creek   Alabama
34        Beatrice   Alabama
35       Beaverton   Alabama
36            Belk   Alabama
37          Benton   Alabama
38           Berry   Alabama
39        Bessemer   Alabama

In [8]:
# Insert City and State into data_col_1 dataframe
data_col_1['City'] = data_split[0]
data_col_1['State'] = data_split[1]
data_col_1.head()

,Location,2010_Population,2017_Population,City,State
0,"Abbeville city, Alabama",2688,2567,Abbeville,Alabama
1,"Adamsville city, Alabama",4522,4347,Adamsville,Alabama
2,"Addison town, Alabama",758,728,Addison,Alabama
3,"Akron town, Alabama",356,332,Akron,Alabama
4,"Alabaster city, Alabama",30352,33202,Alabaster,Alabama

In [9]:
# Convert Poppulation Columns to int
data_col_1["2010_Population"] = pd.to_numeric(data_col_1['2010_Population'], errors='coerce')
data_col_1["2017_Population"] = pd.to_numeric(data_col_1['2017_Population'], errors='coerce')
data_col_1.dtypes

Location            object
2010_Population    float64
2017_Population      int64
City                object
State               object
dtype: object

In [10]:
# Calculate poppulation change
data_col_1['Delta'] = data_col_1['2017_Population'] - data_col_1['2010_Population']
data_col_1.head()

,Location,2010_Population,2017_Population,City,State,Delta
0,"Abbeville city, Alabama",2688.0,2567,Abbeville,Alabama,-121.0
1,"Adamsville city, Alabama",4522.0,4347,Adamsville,Alabama,-175.0
2,"Addison town, Alabama",758.0,728,Addison,Alabama,-30.0
3,"Akron town, Alabama",356.0,332,Akron,Alabama,-24.0
4,"Alabaster city, Alabama",30352.0,33202,Alabaster,Alabama,2850.0

In [11]:
# Rearrange Columns 
data_cleaned = data_col_1[['City', 'State', '2010_Population', '2017_Population', "Delta"]]
data_cleaned.head()

         City     State  2010_Population  2017_Population   Delta
0   Abbeville   Alabama           2688.0             2567  -121.0
1  Adamsville   Alabama           4522.0             4347  -175.0
2     Addison   Alabama            758.0              728   -30.0
3       Akron   Alabama            356.0              332   -24.0
4   Alabaster   Alabama          30352.0            33202  2850.0

In [12]:
data_cleaned.dtypes

City                object
State               object
2010_Population    float64
2017_Population      int64
Delta              float64
dtype: object

In [13]:
# Add Positive/Negative Column
def neg_pos(row):
    change = row["Delta"]
    if change >= 0:
        return "Positive"
    else:
        return "Negative"

In [18]:
data_cleaned["Neg_Pos"]=data_cleaned.apply(neg_pos, axis=1)
data_cleaned.head(20)

,City,State,2010_Population,2017_Population,Delta,Neg_Pos
0,Abbeville,Alabama,2688.0,2567,-121.0,Negative
1,Adamsville,Alabama,4522.0,4347,-175.0,Negative
2,Addison,Alabama,758.0,728,-30.0,Negative
3,Akron,Alabama,356.0,332,-24.0,Negative
4,Alabaster,Alabama,30352.0,33202,2850.0,Positive
5,Albertville,Alabama,21160.0,21392,232.0,Positive
6,Alexander City,Alabama,14875.0,14595,-280.0,Negative
7,Aliceville,Alabama,2486.0,2335,-151.0,Negative
8,Allgood,Alabama,622.0,624,2.0,Positive
9,Altoona,Alabama,933.0,917,-16.0,Negative
10,Andalusia,Alabama,9015.0,8787,-228.0,Negative
11,Anderson,Alabama,282.0,276,-6.0,Negative
12,Anniston,Alabama,23106.0,21770,-1336.0,Negative
13,Arab,Alabama,8050.0,8284,234.0,Positive
14,Ardmore,Alabama,1194.0,1398,204.0,Positive
15,Argo,Alabama,4071.0,4268,197.0,Positive
16,Ariton,Alabama,764.0,739,-25.0,Negative
17,Arley,Alabama,357.0,346,-11.0,Negative
18,Ashford,Alabama,2148.0,2144,-4.0,Negative
19,Ashland,Alabama,2037.0,1932,-105.0,Negative

In [25]:
data_cleaned.index.names = ['id']
data_cleaned.head()

          City     State  2010_Population  2017_Population   Delta   Neg_Pos
id
0    Abbeville   Alabama           2688.0             2567  -121.0  Negative
1   Adamsville   Alabama           4522.0             4347  -175.0  Negative
2      Addison   Alabama            758.0              728   -30.0  Negative
3        Akron   Alabama            356.0              332   -24.0  Negative
4    Alabaster   Alabama          30352.0            33202  2850.0  Positive

In [26]:
# Connect to Local SQL Database
connection = f"root:{password}@localhost/quality_db"
engine = create_engine(f"mysql://{connection}")

In [27]:
# Confirm tables
engine.table_names()

['city_pop']

In [28]:
data_cleaned.to_sql(name='city_pop', con=engine, if_exists='append', index=True)